apache/nuttx/arch/arm/src/common/stm32/stm32_spi_m3m4_v2v3v4.c
#if defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F37XX) || \
    defined(CONFIG_STM32_STM32G4XXX)
static inline uint8_t spi_getreg8(struct stm32_spidev_s *priv,
                                  uint8_t offset)
{
  return getreg8(priv->spibase + offset);
}
#endif

/****************************************************************************
 * Name: spi_putreg
 *
 * Description:
 *   Write a 16-bit value to the SPI register at offset
 *
 * Input Parameters:
 *   priv   - private SPI device structure
 *   offset - offset to the register of interest
 *   value  - the 16-bit value to be written
 *
 * Returned Value:
 *   The contents of the 16-bit register
 *
 ****************************************************************************/

static inline void spi_putreg(struct stm32_spidev_s *priv,
                              uint8_t offset,
                              uint16_t value)
{
  putreg16(value, priv->spibase + offset);
}

/****************************************************************************
 * Name: spi_putreg8
 *
 * Description:
 *   Write an 8-bit value to the SPI register at offset
 *
 * Input Parameters:
 *   priv   - private SPI device structure
 *   offset - offset to the register of interest
 *   value  - the 16-bit value to be written
 *
 * Returned Value:
 *   The contents of the 16-bit register
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F37XX) || \
    defined(CONFIG_STM32_STM32G4XXX)
static inline void spi_putreg8(struct stm32_spidev_s *priv,
                               uint8_t offset,
                               uint8_t value)
{
  putreg8(value, priv->spibase + offset);
}
#endif

/****************************************************************************
 * Name: spi_readword
 *
 * Description:
 *   Read one byte from SPI
 *
 * Input Parameters:
 *   priv - Device-specific state data
 *
 * Returned Value:
 *   Byte as read
 *
 ****************************************************************************/

static inline uint16_t spi_readword(struct stm32_spidev_s *priv)
{
  /* Wait until the receive buffer is not empty */

  while ((spi_getreg(priv, STM32_SPI_SR_OFFSET) & SPI_SR_RXNE) == 0)
    {
    }

  /* Then return the received byte */

#if defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F37XX)|| \
    defined(CONFIG_STM32_STM32G4XXX)
  /* "When the data frame size fits into one byte
   * (less than or equal to 8 bits),
   *  data packing is used automatically when any read or write 16-bit access
   *  is performed on the SPIx_DR register. The double data frame pattern is
   *  handled in parallel in this case. At first, the SPI operates using the
   *  pattern stored in the LSB of the accessed word, then with the other
   *  half stored in the MSB.... The receiver then has to access both data
   *  frames by a single 16-bit read of SPIx_DR as a response to this single
   *  RXNE event. The RxFIFO threshold setting and the following read access
   *  must be always kept aligned at the receiver side, as data can be lost
   *  if it is not in line."
   */

  if (priv->nbits < 9)
    {
      return (uint16_t)spi_getreg8(priv, STM32_SPI_DR_OFFSET);
    }
  else
#endif
    {
      return spi_getreg(priv, STM32_SPI_DR_OFFSET);
    }
}

/****************************************************************************
 * Name: spi_writeword
 *
 * Description:
 *   Write one byte to SPI
 *
 * Input Parameters:
 *   priv - Device-specific state data
 *   byte - Byte to send
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void spi_writeword(struct stm32_spidev_s *priv,
                                 uint16_t word)
{
  /* Wait until the transmit buffer is empty */

  while ((spi_getreg(priv, STM32_SPI_SR_OFFSET) & SPI_SR_TXE) == 0)
    {
    }

  /* Then send the word */

#if defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F37XX) || \
    defined(CONFIG_STM32_STM32G4XXX)
  /* "When the data frame size fits into one byte (less than or equal to 8
   *  bits), data packing is used automatically when any read or write 16-bit
   *  access is performed on the SPIx_DR register. The double data frame
   *  pattern is handled in parallel in this case. At first, the SPI operates
   *  using the pattern stored in the LSB of the accessed word, then with the
   *  other half stored in the MSB...
   *
   *  "A specific problem appears if an odd number of such "fit into one
   *   byte" data frames must be handled. On the transmitter side, writing
   *   the last data frame of any odd sequence with an 8-bit access to
   *   SPIx_DR is enough. ..."
   *
   * REVISIT: "...The receiver has to change the Rx_FIFO threshold level for
   * the last data frame received in the odd sequence of frames in order to
   * generate the RXNE event."
   */

  if (priv->nbits < 9)
    {
      spi_putreg8(priv, STM32_SPI_DR_OFFSET, (uint8_t)word);
    }
  else
#endif
    {
      spi_putreg(priv, STM32_SPI_DR_OFFSET, word);
    }
}

/****************************************************************************
 * Name: spi_dmarxwait
 *
 * Description:
 *   Wait for DMA to complete.
 *
 ****************************************************************************/

#ifdef CONFIG_STM32_SPI_DMA
static int spi_dmarxwait(struct stm32_spidev_s *priv)
{
  int ret;

  /* Take the semaphore (perhaps waiting).  If the result is zero, then the
   * DMA must not really have completed???
   */

  do
    {
      ret = nxsem_wait_uninterruptible(&priv->rxsem);

      /* The only expected error is ECANCELED which would occur if the
       * calling thread were canceled.
       */

      DEBUGASSERT(ret == OK || ret == -ECANCELED);
    }
  while (priv->rxresult == 0 && ret == OK);

  return ret;
}
#endif

/****************************************************************************
 * Name: spi_dmatxwait
 *
 * Description:
 *   Wait for DMA to complete.
 *
 ****************************************************************************/

#ifdef CONFIG_STM32_SPI_DMA
static int spi_dmatxwait(struct stm32_spidev_s *priv)
{
  int ret;

