apache/nuttx/arch/arm/src/common/stm32/stm32_spi_m3m4_v2v3v4.c
  /* 8- or 16-bit mode? */

  if (priv->nbits > 8)
    {
      /* 16-bit mode */

      const uint16_t *src  = (const uint16_t *)txbuffer;
            uint16_t *dest = (uint16_t *)rxbuffer;
            uint16_t  word;

      while (nwords-- > 0)
        {
          /* Get the next word to write.  Is there a source buffer? */

          if (src)
            {
              word = *src++;
            }
          else
            {
              word = 0xffff;
            }

          /* Exchange one word */

          word = (uint16_t)spi_send(dev, (uint32_t)word);

          /* Is there a buffer to receive the return value? */

          if (dest)
            {
              *dest++ = word;
            }
        }
    }
  else
    {
      /* 8-bit mode */

      const uint8_t *src  = (const uint8_t *)txbuffer;
            uint8_t *dest = (uint8_t *)rxbuffer;
            uint8_t  word;

      while (nwords-- > 0)
        {
          /* Get the next word to write.  Is there a source buffer? */

          if (src)
            {
              word = *src++;
            }
          else
            {
              word = 0xff;
            }

          /* Exchange one word */

          word = (uint8_t)spi_send(dev, (uint32_t)word);

          /* Is there a buffer to receive the return value? */

          if (dest)
            {
              *dest++ = word;
            }
        }
    }
}
#endif /* !CONFIG_STM32_SPI_DMA || CONFIG_STM32_DMACAPABLE || CONFIG_STM32_SPI_DMATHRESHOLD */

/****************************************************************************
 * Name: spi_exchange (with DMA capability)
 *
 * Description:
 *   Exchange a block of data on SPI using DMA
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to a buffer in which to receive data
 *   nwords   - the length of data to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface.  If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits >8, the data is packed into
 *              uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_STM32_SPI_DMA
static void spi_exchange(struct spi_dev_s *dev, const void *txbuffer,
                         void *rxbuffer, size_t nwords)
{
  struct stm32_spidev_s *priv = (struct stm32_spidev_s *)dev;
  void *xbuffer = rxbuffer;
  int ret;

  DEBUGASSERT(priv != NULL);

  /* Convert the number of word to a number of bytes */

  size_t nbytes = (priv->nbits > 8) ? nwords << 1 : nwords;

#ifdef CONFIG_STM32_SPI_DMATHRESHOLD
  /* If this is a small SPI transfer, then let spi_exchange_nodma() do the
   * work.
   */

  if (nbytes <= CONFIG_STM32_SPI_DMATHRESHOLD)
    {
      spi_exchange_nodma(dev, txbuffer, rxbuffer, nwords);
      return;
    }
#endif

  if ((priv->rxdma == NULL) || (priv->txdma == NULL) ||
      up_interrupt_context())
    {
      /* Invalid DMA channels, or interrupt context, fall
       * back to non-DMA method.
       */

      spi_exchange_nodma(dev, txbuffer, rxbuffer, nwords);
      return;
    }

#ifdef CONFIG_STM32_DMACAPABLE
  if ((txbuffer && priv->txbuf == 0 &&
      !stm32_dmacapable((uintptr_t)txbuffer, nwords, priv->txccr)) ||
      (rxbuffer && priv->rxbuf == 0 &&
       !stm32_dmacapable((uintptr_t)rxbuffer, nwords, priv->rxccr)))
    {
      /* Unsupported memory region fall back to non-DMA method. */

      spi_exchange_nodma(dev, txbuffer, rxbuffer, nwords);
    }
  else
#endif
    {
      static uint16_t rxdummy = 0xffff;
      static const uint16_t txdummy = 0xffff;
      const size_t word_size = (priv->nbits > 8) ? 2u : 1u;
      const uint8_t *txp;
      uint8_t       *rxp;

      spiinfo("txbuffer=%p rxbuffer=%p nwords=%zu\n",
               txbuffer, rxbuffer, nwords);
      DEBUGASSERT(priv && priv->spibase);

      /* Setup DMAs */

      /* If this bus uses an in-driver buffer we will incur 2 copies,
       * The copy cost is << less the non DMA transfer time and having
       * the buffer in the driver ensures DMA can be used. This is because
       * the API does not support passing the buffer extent so the only
       * extent is buffer + the transfer size. These can sizes be less than
       * the cache line size, and not aligned and typically greater then 4
       * bytes, which is about the break even point for the DMA IO overhead.
       */

      if (txbuffer && priv->txbuf)
        {
          if (nbytes > priv->buflen)
            {
              nbytes = priv->buflen;
            }

          memcpy(priv->txbuf, txbuffer, nbytes);
          txbuffer  = priv->txbuf;
          rxbuffer  = rxbuffer ? priv->rxbuf : rxbuffer;

          /* Rescale nwords to match the (possibly clamped) nbytes. */

          nwords = (priv->nbits > 8) ? nbytes >> 1 : nbytes;
        }

      txp = (const uint8_t *)txbuffer;
      rxp = (uint8_t *)rxbuffer;
      ret = OK;

      /* Walk the request in chunks of at most STM32_SPI_DMA_MAX_XFER words.
       * The STM32 DMA NDTR/CNDTR transfer-count register is only 16 bits
       * wide; submitting more than 65535 transfers in a single descriptor
       * silently programs NDTR to (nwords & 0xffff) and on most paths
       * results in a stream that never raises transfer-complete, causing
       * the SPI driver to block forever in spi_dmarxwait().  Splitting the
       * request keeps each descriptor within the hardware limit and lets
       * the W25/SD/etc. driver remain agnostic of this constraint.
       */

      while (nwords > 0)
        {
          size_t chunk = (nwords > STM32_SPI_DMA_MAX_XFER)
                         ? STM32_SPI_DMA_MAX_XFER
                         : nwords;

          spi_dmarxsetup(priv, rxp, &rxdummy, chunk);
          spi_dmatxsetup(priv, txp, &txdummy, chunk);

#ifdef CONFIG_SPI_TRIGGER
          /* Is deferred triggering in effect? */

          if (!priv->defertrig)
            {
              /* No.. Start the DMAs */

              spi_dmarxstart(priv);
              spi_dmatxstart(priv);
            }
          else
            {
              /* Yes.. indicate that we are ready to be started.  Deferred
               * triggering is only meaningful for the first (often only)
               * chunk; subsequent chunks must run unconditionally or the
               * caller would have to re-arm between chunks.
               */

